### Imports

In [37]:
import pandas as pd
import numpy as np
from tqdm import tqdm
from utils import load_raw_data, clean_data, train_val_set

In [31]:
# Source ext. scripts when saved
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

### Load data

In [113]:
base_path = '/Users/Neezy/Desktop/ds_projects/m5_forecasting/data/'
calendar, sell_prices, sales = load_raw_data(base_path)

In [123]:
calendar.head()

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,2011-01-29,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
1,2011-01-30,11101,Sunday,2,1,2011,d_2,NaN,NaN,NaN,NaN,0,0,0
2,2011-01-31,11101,Monday,3,1,2011,d_3,NaN,NaN,NaN,NaN,0,0,0
3,2011-02-01,11101,Tuesday,4,2,2011,d_4,NaN,NaN,NaN,NaN,1,1,0
4,2011-02-02,11101,Wednesday,5,2,2011,d_5,NaN,NaN,NaN,NaN,1,0,1

### Tidy dataframe

In [114]:
# Tidy dataframe
id_vars = ['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id']
sales = clean_data(sales, id_vars, 'day', 'sales')
# Convert rows
digit_vars = ['store_id', 'dept_id', 'day', 'item_id', 'dept_id']
reg_pat = '(\d{1,4}$)'
sales[digit_vars] = sales[digit_vars].apply(
    lambda x: x.str.extract(reg_pat, expand=False).astype(int))
sales.head()

,id,item_id,dept_id,cat_id,store_id,state_id,day,sales
0,HOBBIES_1_001_CA_1_validation,1,1,HOBBIES,1,CA,1,0
1,HOBBIES_1_002_CA_1_validation,2,1,HOBBIES,1,CA,1,0
2,HOBBIES_1_003_CA_1_validation,3,1,HOBBIES,1,CA,1,0
3,HOBBIES_1_004_CA_1_validation,4,1,HOBBIES,1,CA,1,0
4,HOBBIES_1_005_CA_1_validation,5,1,HOBBIES,1,CA,1,0

In [116]:
sales.to_pickle(base_path + 'sales_init_pp.pkl')

### Sample Data

In [117]:
sales.head()

,id,item_id,dept_id,cat_id,store_id,state_id,day,sales
0,HOBBIES_1_001_CA_1_validation,1,1,HOBBIES,1,CA,1,0
1,HOBBIES_1_002_CA_1_validation,2,1,HOBBIES,1,CA,1,0
2,HOBBIES_1_003_CA_1_validation,3,1,HOBBIES,1,CA,1,0
3,HOBBIES_1_004_CA_1_validation,4,1,HOBBIES,1,CA,1,0
4,HOBBIES_1_005_CA_1_validation,5,1,HOBBIES,1,CA,1,0

In [118]:
item_ids_sample = sales['item_id'].sample(30)

In [119]:
sales_sample = sales[sales['item_id'].isin(item_ids_sample)]; sales_sample.shape

(2869500, 8)

In [120]:
sales_sample['day'].unique()

array([   1,    2,    3, ..., 1911, 1912, 1913])

In [121]:
sales_sample.to_pickle(base_path + 'sales_sample.pkl')